app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-28 22:22:59.182303"], ["updated_at", "2018-11-28 22:22:59.182303"]]
---
  def create
    @school_class = SchoolClass.create(post_params)

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def show
    @school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
---
  def edit
    @school_class = SchoolClass.find_by(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-28 22:48:38.289119"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find_by(params[:id])
    @school_class.update(post_params)