app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-11-28 22:30:27.546334"], ["updated_at", "2018-11-28 22:30:27.546334"]]
---
  def create
    @student = Student.create(post_params)

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
---
  def edit
    @student = Student.find_by(params[:id])

SELECT  "students".* FROM "students" WHERE (1) LIMIT 1
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-11-28 22:46:43.221407"], ["id", 1]]
---
  def update
    @student = Student.find_by(params[:id])
    @student.update(post_params)